{
    "class_name": "Barbarian",
    "hit_dice": "1d12",
    "hit_point_level_1": "12 + Constitution Mod",
    "hit_point_higher_level": "1d12 (or 7) + Constitution Mod after level 1",
    "proficiency": {
        "armor": ["light", "medium", "shield"],
        "weapon": ["simple", "martial"]
    },
    "ability_score_increase": [
        {
            "name": "Any",
            "amount_increase": 1
        },
        {
            "name": "Any",
            "amount_increase": 1
        }
    ],
    "tools": {
        "amount": 0,
        "tools_list": []
    },
    "class_saving_throw": {
        "ability": ["Strength", "Constitution"]
    },
    "skill_proficiency": {
        "amount": 2,
        "option": ["Animal Handling", "Athletics", "Intimidation", "Nature", "Perception", "Survival"]
    },
    "equipment": ["Greataxe or any martial melee weapon", "Two handaxes or any simple weapon", "Explorer's pack", "four Javaline"],
    "class_table": [
        {
            "level": 1,
            "proficiency_bonus": 2,
            "feature": "Rage, Unarmored Defense",
            "rages": 2,
            "rage_damage": 2
        },
        {
            "level": 2,
            "proficiency_bonus": 2,
            "feature": "Reckless Attack, Danger Sense",
            "rages": 2,
            "rage_damage": 2
        },
        {
            "level": 3,
            "proficiency_bonus": 2,
            "feature": "Primal Path",
            "rages": 3,
            "rage_damage": 2
        },
        {
            "level": 4,
            "proficiency_bonus": 2,
            "feature": "Ability Score Improvement",
            "rages": 3,
            "rage_damage": 2
        },
        {
            "level": 5,
            "proficiency_bonus": 3,
            "feature": "Extra Attack, Fast Movement",
            "rages": 3,
            "rage_damage": 2
        },
        {
            "level": 6,
            "proficiency_bonus": 3,
            "feature": "Path feature",
            "rages": 4,
            "rage_damage": 2
        },
        {
            "level": 7,
            "proficiency_bonus": 3,
            "feature": "Feral Instinct",
            "rages": 4,
            "rage_damage": 2
        },
        {
            "level": 8,
            "proficiency_bonus": 3,
            "feature": "Ability Score Improvement",
            "rages": 4,
            "rage_damage": 2
        },
        {
            "level": 9,
            "proficiency_bonus": 4,
            "feature": "Brutal Critical (1 die)",
            "rages": 4,
            "rage_damage": 2
        },
        {
            "level": 10,
            "proficiency_bonus": 4,
            "feature": "Path feature",
            "rages": 4,
            "rage_damage": 2
        },
        {
            "level": 11,
            "proficiency_bonus": 4,
            "feature": "Relentless Rage",
            "rages": 4,
            "rage_damage": 2
        },
        {
            "level": 12,
            "proficiency_bonus": 4,
            "feature": "Ability Score Improvement",
            "rages": 5,
            "rage_damage": 2
        },
        {
            "level": 13,
            "proficiency_bonus": 5,
            "feature": "Brutal Critical (2 dice)",
            "rages": 5,
            "rage_damage": 2
        },
        {
            "level": 14,
            "proficiency_bonus": 5,
            "feature": "Path feature",
            "rages": 5,
            "rage_damage": 2
        },
        {
            "level": 15,
            "proficiency_bonus": 5,
            "feature": "Persistent Rage",
            "rages": 5,
            "rage_damage": 2
        },
        {
            "level": 16,
            "proficiency_bonus": 5,
            "feature": "Ability Score Improvement",
            "rages": 5,
            "rage_damage": 2
        },
        {
            "level": 17,
            "proficiency_bonus": 6,
            "feature": "Brutal Critical (3 dice)",
            "rages": 6,
            "rage_damage": 2
        },
        {
            "level": 18,
            "proficiency_bonus": 6,
            "feature": "Indomitable Might",
            "rages": 6,
            "rage_damage": 2
        },
        {
            "level": 19,
            "proficiency_bonus": 6,
            "feature": "Ability Score Improvement",
            "rages": 6,
            "rage_damage": 2
        },
        {
            "level": 20,
            "proficiency_bonus": 6,
            "feature": "Primal Champion",
            "rages": "unlimited",
            "rage_damage": 2
        }
    ],
    "spellcasting_ability": null,
    "features": [
        {
            "name": "Rage",
            "description": [
                "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action. While raging, you gain the following benefits if you aren’t wearing heavy armor:",
                "You have advantage on Strength checks and Strength saving throws.",
                "When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column o f the Barbarian table.",
                "You have resistance to bludgeoning, piercing, and slashing damage."
            ],
            "duration": "1 minute",
            "level": 1
        },
        {
            "name": "Unarmored Defense",
            "description": ["While you are not w earing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit."],
            "level": 2
        },
        {
            "name": "Reckless Attack",
            "description": ["Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn."],
            "level": 2
        },
        {
            "name": "Danger Sense",
            "description": [
                "At 2nd level, you gain an uncanny sense o f when things nearby aren’t as they should be, giving you an edge when you dodge away from danger.",
                "You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated."
            ],
            "level": 2
        },
        {
            "name": "Primal Path",
            "description": ["At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end o f the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels."],
            "path": ["Path of the Berserker", "Path of the Totem Warrior"]
        },
        {
            "name": "Extra Attack",
            "description": ["Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn."],
            "level": 5
        },
        {
            "name": "Feral Instinct",
            "description": [
                "By 7th level, your instincts are so honed that you have advantage on initiative rolls.",
                "Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
            ],
            "level": 7
        },
        {
            "name": "Brutal Critical",
            "description": [
                "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.",
                "This increases to two additional dice at 13th level and three additional dice at 17th level."
            ],
            "level": 9,
            "Value": {
                "name": "critical hit",
                "value": [
                    {
                        "level": 9,
                        "extra_dice": 1
                    },
                    {
                        "level": 13,
                        "extra_dice": 2
                    },
                    {
                        "level": 17,
                        "extra_dice": 3
                    }
                ]
            }
        },
        {
            "name": "Relentless Rage",
            "description": [
                "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.",
                "Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
            ],
            "level": 11
        },
        {
            "name": "Persistent Rage",
            "description": ["Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it."],
            "level": 15
        },
        {
            "name": "Indomitable Might",
            "description": ["Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place o f the total."],
            "level": 18
        },
        {
            "name": "Primal Champion",
            "description": ["At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."],
            "level": 20
        }
    ],
    "extra_feature": [
        {
            "name": "Path of the Berserker",
            "description": ["For some barbarians, rage is a means to an end-—that end being violence. The Path of the Berserker is a path of untrammeled fury, slick with blood. As you enter the berserker’s rage, you thrill in the chaos o f battle, heedless of your own health or well-being."],
            "feature": [
                {
                    "name": "Frenzy",
                    "description": [
                        "Starting when you choose this path at 3rd level, you can go into a frenzy when you rage.",
                        "If you do so, for the duration of your rage you can make a single melee weapon attack as a bonus action on each of your turns after this one. When your rage ends, you suffer one level of exhaustion"
                    ],
                    "level": 3
                },
                {
                    "name": "Mindless Rage",
                    "description": [
                        "Beginning at 6th level, you can’t be charmed or frightened while raging.",
                        "If you are charmed or frightened when you enter your rage, the effect is suspended for the duration o f the rage."
                    ],
                    "level": 6
                },
                {
                    "name": "Intimidating Presence",
                    "description": [
                        "Beginning at 10th level, you can use your action to frighten someone with your menacing presence.",
                        "When you do so, choose one creature that you can see within 30 feet of you.",
                        "If the creature can see or hear you, it must succeed on a Wisdom saving throw (DC equal to 8 + your proficiency bonus + your Charisma modifier) or be frightened of you until the end o f your next turn.",
                        "On subsequent turns, you can use your action to extend the duration of this effect on the frightened creature until the end of your next turn.",
                        "This effect ends if the creature ends its turn out of line o f sight or more than 60 feet away from you. If the creature succeeds on its saving throw, you can't use this feature on that creature again for 24 hours."
                    ],
                    "level": 10
                },
                {
                    "name": "Retaliation",
                    "description": ["Starting at 14th level, when you take damage from a creature that is within 5 feet of you. you can use your reaction to make a melee weapon attack against that creature."],
                    "level": 14
                }
            ]
        },
        {
            "name": "Path of the Totem Warrior",
            "description": [
                "The Path o f the Totem Warrior is a spiritual journey, as the barbarian accepts a spirit animal as guide, protector, and inspiration. In battle, your totem spirit fills you with supernatural might, adding magical fuel to your barbarian rage.",
                "Most barbarian tribes consider a totem animal to be kin to a particular clan. In such cases, it is unusual for an individual to have more than one totem animal spirit, though exceptions exist."
            ],
            "feature": [
                {
                    "name": "Spirit Seeker",
                    "level": 3,
                    "description": ["Yours is a path that seeks attunement with the natural word, giving you a kinship with beasts. At 3rd level when you adopt this path, you gain the ability to cast the beast sense and speak with animals spells, but only as rituals, as described in chapter 10."]
                },
                {
                    "name": "Totem Spirit",
                    "level": 3,
                    "description": [
                        "At 3rd level, when you adopt this path, you choose a totem spirit and gain its feature. You must make or acquire a physical totem object- an amulet or similar adornment—that incorporates fur or feathers, claws, teeth, or b ones o f the totem animal. At your option, you also gain minor physical attributes that are reminiscent of your totem spirit. For example, if you have a bear totem spirit, you might be unusually hairy and thickskinned, or if your totem is the eagle, your eyes turn bright yellow.",
                        "Your totem animal might be an animal related to those listed here but more appropriate to your homeland. For example, you could choose a hawk or vulture in place of an eagle."
                    ],
                    "beast_spirit": [
                        {
                            "name": "bear",
                            "description": "While raging, you have resistance to all damage except psychic damage. The spirit of the bear makes you tough enough to stand up to any punishment."
                        },
                        {
                            "name": "eagle",
                            "description": "While you're raging and aren’t wearing heavy armor, other creatures have disadvantage on opportunity attack rolls against you, and you can use the Dash action as a bonus action on your turn. The spirit of the eagle makes you into a predator w ho can weave through the fray with ease."
                        },
                        {
                            "name": "wolf",
                            "description": "While you're raging, your friends have advantage on melee attack rolls against any creature within 5 feet o f you that is hostile to you. The spirit of the wolf makes you a leader o f hunters."
                        }
                    ]                 
                },
                {
                    "name": "Aspect of the Beast",
                    "level": 6,
                    "description": ["At 6th level, you gain a magical benefit based on the totem animal o f your choice. You can choose the same animal you selected at 3rd level or a different one."],
                    "beast_spirit": [
                        {
                            "name": "bear",
                            "description": "You gain the might o f a bear. Your carrying capacity (including maximum load and maximum lift) is doubled, and you have advantage on Strength checks made to push, pull, lift, or break objects."
                        },
                        {
                            "name": "eagle",
                            "description": "You gain the eyesight o f an eagle. You can see up to 1 mile away with no difficulty, able to discern even fine details as though looking at something no more than 100 feet away from you. Additionally, dim light doesn't impose disadvantage"
                        },
                        {
                            "name": "wolf",
                            "description": "You gain the hunting sensibilities o f a wolf. You can track other creatures while traveling at a fast pace, and you can move stealthily while traveling at a normal pace (see chapter 8 for rules on travel pace)."
                        }
                    ]                 
                },
                {
                    "name": "Spirit Walker",
                    "level": 10,
                    "description": ["At 10th level, you can cast the commune with nature spell, but only as a ritual. When you do so, a spiritual version o f one o f the animals you chose for Totem Spirit or Aspect o f the Beast appears to you to convey the information you seek."]
                },
                {
                    "name": "Totemic Attunement",
                    "level": 14,
                    "description": ["At 14th level, you gain a magical benefit based on a totem animal o f your choice. You can choose the same animal you selected previously or a different one."],
                    "beast_spirit": [
                        {
                            "name": "bear",
                            "description": "While you’re raging, any creature within 5 feet of you that’s hostile to you has disadvantage on attack rolls against targets other than you or another character with this feature. An enemy is immune to this effect if it can’t see or hear you or if it can’t be frightened."
                        },
                        {
                            "name": "eagle",
                            "description": "While raging, you have a flying speed equal to your current walking speed. This benefit works only in short bursts; you fall if you end your turn in the air and nothing else is holding you aloft."
                        },
                        {
                            "name": "wolf",
                            "description": "While you’re raging, you can use a bonus action on your turn to knock a Large or smaller creature prone when you hit it with melee w eapon attack."
                        }
                    ]                 
                }
            ]
        }
    ]
}